-- MySQL dump 10.13  Distrib 8.0.26, for Win64 (x86_64)
--
-- Host: localhost    Database: 3teamnew
-- ------------------------------------------------------
-- Server version	8.0.26

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `elementary`
--

DROP TABLE IF EXISTS `elementary`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `elementary` (
  `행정구역별` text,
  `2016년` text,
  `2017년` text,
  `2018년` text,
  `2019년` text,
  `2020년` text,
  `2021년` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `elementary`
--

LOCK TABLES `elementary` WRITE;
/*!40000 ALTER TABLE `elementary` DISABLE KEYS */;
INSERT INTO `elementary` VALUES ('행정구역별','2016','2017','2018','2019','2020','2021'),('전국','2672843','2674227','2711385','2747219','2693716','2672340'),('서울특별시','436121','428333','424875','422293','409536','399435'),('부산광역시','151207','150863','152775','155589','153527','-'),('대구광역시','125541','124708','125160','126122','122587','121308'),('인천광역시','155590','156470','158871','160853','156928','155271'),('광주광역시','89095','88189','88622','88990','86419','84998'),('대전광역시','85939','84240','83453','82743','79807','77884'),('울산광역시','65629','66016','67290','68512','67397','66919'),('세종특별자치시','17910','20764','24865','27892','29487','30726'),('경기도','727380','733941','752499','769744','761731','763912'),('강원도','76772','75722','75412','75617','73478','72373'),('충청북도','84052','84240','85344','86709','85135','84263'),('충청남도','115309','116963','120152','122424','120115','118771'),('전라북도','97895','97383','97606','97731','94661','92914'),('전라남도','92981','93233','94134','94952','92405','91229'),('경상북도','127825','127642','129290','131374','129079','127912'),('경상남도','185325','186619','191016','194606','190849','189176'),('제주특별자치도','38272','38901','40096','41068','40575','41328');
/*!40000 ALTER TABLE `elementary` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `elementary_ratio`
--

DROP TABLE IF EXISTS `elementary_ratio`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `elementary_ratio` (
  `행정구역별` text,
  `2016년` text,
  `2017년` text,
  `2018년` text,
  `2019년` text,
  `2020년` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `elementary_ratio`
--

LOCK TABLES `elementary_ratio` WRITE;
/*!40000 ALTER TABLE `elementary_ratio` DISABLE KEYS */;
INSERT INTO `elementary_ratio` VALUES ('행정구역별','2016','2017','2018','2019','2020'),('전국','5.2 ','5.2 ','5.3 ','5.3 ','5.2 '),('서울특별시','4.4 ','4.4 ','4.4 ','4.4 ','4.3 '),('부산광역시','4.4 ','4.4 ','4.5 ','4.6 ','4.6 '),('대구광역시','5.1 ','5.1 ','5.1 ','5.2 ','5.1 '),('인천광역시','5.3 ','5.3 ','5.4 ','5.4 ','5.3 '),('광주광역시','5.9 ','5.9 ','5.9 ','6.0 ','5.8 '),('대전광역시','5.6 ','5.5 ','5.5 ','5.5 ','5.4 '),('울산광역시','5.6 ','5.7 ','5.9 ','6.0 ','5.9 '),('세종특별자치시','7.4 ','7.5 ','8.0 ','8.2 ','8.3 '),('경기도','5.7 ','5.7 ','5.7 ','5.8 ','5.6 '),('강원도','5.0 ','5.0 ','5.0 ','5.0 ','4.8 '),('충청북도','5.2 ','5.2 ','5.3 ','5.3 ','5.2 '),('충청남도','5.4 ','5.4 ','5.5 ','5.6 ','5.5 '),('전라북도','5.3 ','5.3 ','5.4 ','5.4 ','5.3 '),('전라남도','5.2 ','5.2 ','5.3 ','5.3 ','5.2 '),('경상북도','4.8 ','4.8 ','4.8 ','4.9 ','4.9 '),('경상남도','5.5 ','5.6 ','5.7 ','5.8 ','5.7 '),('제주특별자치도','6.1 ','6.1 ','6.1 ','6.2 ','6.0 ');
/*!40000 ALTER TABLE `elementary_ratio` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `new_marry`
--

DROP TABLE IF EXISTS `new_marry`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `new_marry` (
  `행정구역별` text,
  `2016년` text,
  `2017년` text,
  `2018년` text,
  `2019년` text,
  `2020년` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `new_marry`
--

LOCK TABLES `new_marry` WRITE;
/*!40000 ALTER TABLE `new_marry` DISABLE KEYS */;
INSERT INTO `new_marry` VALUES ('행정구역별','2016','2017','2018','2019','2020'),('전국','281635','264455','257622','239159','213502'),('서울특별시','57643','53776','52005','48261','44746'),('부산광역시','17113','15677','14781','13780','12128'),('대구광역시','12216','11392','10967','9880','8340'),('인천광역시','16092','15235','14850','13401','11574'),('광주광역시','7468','7141','6632','6297','5560'),('대전광역시','8325','7697','7377','6602','5976'),('울산광역시','7006','6331','5894','5442','4737'),('세종특별자치시','1612','1728','2038','2039','1854'),('경기도','70052','66429','66877','62356','57814'),('강원도','7468','7295','6994','6762','5868'),('충청북도','8334','7990','7827','7239','6682'),('충청남도','11792','10961','10970','9826','8493'),('전라북도','8216','7817','7219','7005','6053'),('전라남도','8554','8049','7587','7413','6365'),('경상북도','13363','12190','11687','10637','9046'),('경상남도','17580','15978','14996','13613','11900'),('제주특별자치도','3705','3654','3638','3358','2981'),('국외','5096','5115','5283','5248','3385');
/*!40000 ALTER TABLE `new_marry` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `new_marry_ratio`
--

DROP TABLE IF EXISTS `new_marry_ratio`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `new_marry_ratio` (
  `행정구역별` text,
  `2016년` text,
  `2017년` text,
  `2018년` text,
  `2019년` text,
  `2020년` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `new_marry_ratio`
--

LOCK TABLES `new_marry_ratio` WRITE;
/*!40000 ALTER TABLE `new_marry_ratio` DISABLE KEYS */;
INSERT INTO `new_marry_ratio` VALUES ('행정구역별','2016','2017','2018','2019','2020'),('전국','5.6','5.4','5.2','4.8','4.6'),('서울특별시','5.6','5.4','5.2','4.8','4.6'),('부산광역시','5.2','4.8','4.6','4.2','4'),('대구광역시','5','4.8','4.6','4.4','4.2'),('인천광역시','6','5.8','5.4','5.2','4.8'),('광주광역시','5.2','5','4.8','4.6','4.2'),('대전광역시','5.6','5.2','5','4.6','4.4'),('울산광역시','6.4','6.2','5.8','5.4','5'),('세종특별자치시','8.2','8','8','7.6','7'),('경기도','6','5.8','5.6','5.4','5'),('강원도','5','4.8','4.6','4.6','4.4'),('충청북도','5.4','5.2','5','4.8','4.4'),('충청남도','5.6','5.4','5.2','5','4.6'),('전라북도','4.6','4.4','4.2','4','3.8'),('전라남도','5','4.8','4.4','4.2','4'),('경상북도','5','4.8','4.6','4.4','4'),('경상남도','5.6','5.4','5','4.8','4.4'),('제주특별자치도','6','5.8','5.6','5.4','5');
/*!40000 ALTER TABLE `new_marry_ratio` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `population`
--

DROP TABLE IF EXISTS `population`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `population` (
  `행정구역별` text,
  `2016년` text,
  `2017년` text,
  `2018년` text,
  `2019년` text,
  `2020년` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `population`
--

LOCK TABLES `population` WRITE;
/*!40000 ALTER TABLE `population` DISABLE KEYS */;
INSERT INTO `population` VALUES ('행정구역별(읍면동)','2016','2017','2018','2019','2020'),('전국','51269554','51422507','51629512','51779203','51829136'),('서울특별시','9805506','9741871','9673936','9639541','9586195'),('부산광역시','3440484','3416918','3395278','3372692','3349016'),('대구광역시','2461002','2453041','2444412','2429940','2410700'),('인천광역시','2913024','2925967','2936117','2952237','2945454'),('광주광역시','1501557','1496172','1490092','1489730','1477573'),('대전광역시','1535445','1525849','1511214','1498839','1488435'),('울산광역시','1166033','1157077','1150116','1143692','1135423'),('세종특별자치시','242507','276589','312374','338136','353933'),('경기도','12671956','12851601','13103188','13300900','13511676'),('강원도','1521751','1521386','1520391','1520127','1521763'),('충청북도','1603404','1611009','1620935','1629343','1632088'),('충청남도','2132566','2162426','2181416','2188649','2176636'),('전라북도','1833168','1826174','1818157','1807423','1802766'),('전라남도','1796017','1792319','1790352','1787543','1788807'),('경상북도','2682169','2677058','2672902','2668154','2644757'),('경상남도','3339633','3345293','3350350','3347209','3333056'),('제주특별자치도','623332','641757','658282','665048','670858');
/*!40000 ALTER TABLE `population` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `solo`
--

DROP TABLE IF EXISTS `solo`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `solo` (
  `행정구역별` text,
  `2016년` text,
  `2017년` text,
  `2018년` text,
  `2019년` text,
  `2020년` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `solo`
--

LOCK TABLES `solo` WRITE;
/*!40000 ALTER TABLE `solo` DISABLE KEYS */;
INSERT INTO `solo` VALUES ('행정구역별','2016','2017','2018','2019','2020'),('전국','27.9','28.6','29.3','30.2','31.7'),('서울특별시','30.1','31.0','32.0','33.4','34.9'),('부산광역시','27.7','28.7','29.7','30.7','32.4'),('대구광역시','26.4','27.4','28.2','29.4','30.9'),('인천광역시','23.9','24.7','25.2','26.6','28.3'),('광주광역시','29.0','29.8','30.2','31.1','32.4'),('대전광역시','30.4','31.5','32.5','33.7','36.3'),('울산광역시','24.6','25.1','25.6','26.5','27.7'),('세종특별자치시','30.6','30.2','30.0','30.1','31.3'),('경기도','23.8','24.4','25.2','26.3','27.6'),('강원도','32.1','32.2','32.8','32.9','35.0'),('충청북도','30.3','31.0','31.8','32.9','34.8'),('충청남도','30.4','31.1','31.8','32.5','34.2'),('전라북도','30.7','31.2','31.7','32.3','33.8'),('전라남도','31.2','31.6','31.9','32.1','33.7'),('경상북도','31.3','31.9','32.3','32.7','34.4'),('경상남도','28.1','28.6','29.1','29.6','30.9'),('제주특별자치도','27.4','28.6','29.4','29.7','31.1');
/*!40000 ALTER TABLE `solo` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `solo_num`
--

DROP TABLE IF EXISTS `solo_num`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `solo_num` (
  `행정구역별` text,
  `2016년` text,
  `2017년` text,
  `2018년` text,
  `2019년` text,
  `2020년` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `solo_num`
--

LOCK TABLES `solo_num` WRITE;
/*!40000 ALTER TABLE `solo_num` DISABLE KEYS */;
INSERT INTO `solo_num` VALUES ('행정구역별','2016','2017','2018','2019','2020'),('전국','5397615','5618677','5848594','6147516','6643354'),('서울특별시','1138860','1180540','1229421','1299787','1390701'),('부산광역시','372412','388899','404408','423227','455207'),('대구광역시','247444','259525','269903','284416','304543'),('인천광역시','254076','266434','275898','297865','324841'),('광주광역시','165169','171424','174614','182364','193948'),('대전광역시','179605','188136','195544','205165','228842'),('울산광역시','104856','107497','110236','116015','122848'),('세종특별자치시','27683','31472','35763','39078','43577'),('경기도','1067916','1124541','1197586','1290893','1406010'),('강원도','197917','199645','206295','208857','231371'),('충청북도','187377','195186','204109','215196','236208'),('충청남도','247056','259727','270497','280773','304973'),('전라북도','222201','227600','232587','238746','255269'),('전라남도','227225','232022','235062','238147','256633'),('경상북도','336547','346998','353702','360213','388791'),('경상남도','358430','370293','379719','391421','417737'),('제주특별자치도','62841','68738','73250','75353','81855');
/*!40000 ALTER TABLE `solo_num` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-01-06  9:48:10
